Revit 2024 API
BuiltInFailures.ElectricalFailures.WireMaxSizeNonexistent Property
 Cannot find max size in current wire type's material table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WireMaxSizeNonexistent { get; }
Visual Basic
Public Shared ReadOnly Property WireMaxSizeNonexistent As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WireMaxSizeNonexistent {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace